use `heanes.com`;
set FOREIGN_KEY_CHECKS = 0;

/**
 * @doc 导入管理员用户数据
 * @author Heanes
 * @time 2015-07-04 09:27:10
 */
truncate `heanes.com`.`pre_admin_user`;
insert into `heanes.com`.`pre_admin_user` (
    `user_name`, `user_pwd`, `user_email`, `create_time`)
values
    ('admin', 'd6f19b13cc75b70cabe99ca6d92e5de7', 'heanes@163.com', '1425922473');

#================================================网站设置类数据导入=============================================#
truncate `heanes.com`.`pre_setting_common`;
insert into `heanes.com`.`pre_setting_common` (
    `parent_id`, `code`, `input_type`, `input_range`, `store_value`, `order_number`, `can_edit`)
values
    # 默认管理员
    ('1', 'default_admin', 'text', null, 'admin', '1', '0')
    #-------------------------------------------网站信息设置
    # 网站名称
    , ('1', 'site_name', 'text', null, '金乐汇', '1', '1')
    # 网站logo
    , ('1', 'web_logo', 'file', null, 'logo.jpg', '1', '1')
    # 网站版权申明
    , ('1', 'web_copyright', 'text', null, '<div style=\"text-align:center;\">\r\n<span style=\"line-height:1.5;\">版权所有&copy;宏超科技 京ICP备15019724</span> \r\n</div>', '1', '1')
    # 网站关键字
    , ('1', 'web_keywords', 'text', null, '金乐汇P2P|金乐汇|金乐汇金融超市|金乐汇金融|金乐汇理财|网络理财|理财|投资理财|P2P理财|互联网金融|债权转让|理财计划|网络贷款|网贷|企业贷|个人贷', '1', '1')
    # 网站描述
    , ('1', 'web_description', 'textarea', null, '金乐汇打造互联网金融超市', '1', '1')
    # 网站名称
    , ('1', 'web_name', 'text', null, '金乐汇', '1', '1')
    # 网站标题
    , ('1', 'web_title', 'text', null, '网站名称，显示在浏览器标题栏', '1', '1')
    # 网站联系地址-国家
    , ('1', 'web_country', 'text', null, '中国', '1', '1')
    # 网站联系地址-省
    , ('1', 'web_province', 'text', null, '北京', '1', '1')
    # 网站联系地址-市
    , ('1', 'web_city', 'text', null, '海淀', '1', '1')
    # 网站联系地址-区
    , ('1', 'web_region', 'text', null, '花园桥', '1', '1')
    # 网站详细地址
    , ('1', 'service_address', 'text', null, '北京市海淀区世纪经贸大厦A座2904室', '1', '1')
    # 网站服务邮箱
    , ('1', 'service_email', 'text', null, 'service@jinlehui.net', '1', '1')
    # 网站备案信息
    , ('1', 'icp_number', 'text', null, '京ICP证 100953号', '1', '1')
    # 网站备案文件
    , ('1', 'icp_file', 'file', '网站备案的证书文件', 'cert.png', '1', '1')
    #-------------------------------------------网站功能设置
    # 是否支持注册
    , ('1', 'enable_register', 'select', '1,0', '1', '1', '1')
    # 是否开启验证码
    , ('1', 'captcha_enable', 'select', '0,1', '是否启用登录验证码', '1', '1')
    # 尝试多少次后验证验证码
    , ('1', 'theme_web', 'text', '网站主题', 'default', '1', '1')
    # 网站是否关闭
    , ('1', 'web_close', 'select', '0,1', '0', '1', '1')
    # 网站关闭原因
    , ('1', 'web_close_description', 'textarea', null, '网站暂时关闭，敬请耐心等待', '1', '1')
    # 网站语言
    , ('1', 'lang', 'select', 'zh_cn,en_us', 'zh_cn', '1', '1')
    # 网站图片水印
    , ('1', 'watermark', 'file', null, 'watermark.png', '1', '1')
    # 网站水印位置
    , ('1', 'watermark_place', 'text', '0,1,2,3,4,5', '水印位置', '1', '1')
    # 网站水印透明度
    , ('1', 'watermark_alpha', 'text', null, '10', '1', '1')
    # rewrite重写功能
    , ('1', 'rewrite', 'select', '0,1,2', '1', '1', '1')
    # 文件上传大小限制
    #------------------------------------------网站显示设置
    , ('1', 'upload_size_limit', 'text', '-1,0,64,128,256,512,1024,2048,4096', '4096', '1', '1')
    # 首页文章显示条数
    , ('1', 'home_article_num', 'text', '5', '首页文章显示条数', '1', '1')
    # 首页友情链接是否显示图片
    , ('1', 'friendly_link_logo', 'text', '0,1', '尾部友情链接是否显示图片，0-不显示，1-显示', '1', '1')
    #-----------------------------------------网站开发信息
    # 网站安装时间
    , ('1', 'web_install_time', 'text', '', '网站安装时间，不可更改，作为参考信息', '1', '1')
    # 网站运营时间
    , ('1', 'web_run_time', 'text', '2年', '网站运营时间，可以更改', '1', '1');

/**
 * @doc 手机端导航
 * @author Heanes
 * @time 2015-08-18 09:25:58
 */
truncate `heanes.com`.`pre_navigation_wap`;
insert into `heanes.com`.`pre_navigation_wap` (
    `name`, `parent_id`, `a_href`, `a_title`, `a_target`, `img_src`, `img_src_hover`, `img_src_active`, `create_time`, `order_number`)
values
    ('首页', '0', '/wap/index.php', '首页', '1', 'home.png', 'home-hover.png', 'index', '1362094066', '1')
    , ('资讯', '0', '/wap/index.php?act=article&category=notice', '资讯', '1', 'news.png', 'news-hover.png', 'article', '1362094066', '2')
    , ('创业之家', '0', '/wap/index.php?act=special&id=1', '创业之家', '1', 'startup.png', 'startup-hover.png', 'specialTopic,employee', '1362094066', '3')
    , ('我的', '0', '/wap/index.php?act=member', '个人中心', '1', 'member.png', 'member-hover.png', 'member,menu,service', '1362094066', '4');

/**
 * @doc 网站幻灯设置
 * @author Heanes
 * @time 2015-08-19 15:07:17
 */
truncate `heanes.com`.`pre_slide_wap`;
insert into `heanes.com`.`pre_slide_wap` (
    `name`, `img_src`, `a_href`, `a_target`, `title`, `description`, `order_number`, `create_time`, `is_enable`)
values
    ('第1张幻灯', '1.jpg', '/wap/index.php', '1', '欢迎访问', '第2张幻灯', '2', '1436471342', '1')
    , ('第2张幻灯', '2.jpg', '/wap/index.php', '2', '欢迎访问', '第2张幻灯', '3', '1436471342', '1')
    , ('第3张幻灯', '3.jpg', '/wap/index.php?act=money&op=apply', '3', '欢迎访问', '第3张幻灯', '1', '1436471342', '1')
    , ('第4张幻灯', '4.jpg', '/wap/index.php', '4', '欢迎访问', '第4张幻灯', '4', '1436471342', '1')
    , ('第5张幻灯', '5.jpg', '/wap/index.php?act=employee&op=introduce', '5', '欢迎访问', '第5张幻灯', '5', '1436471342', '1');

/**
 * @doc 会员中心菜单
 * @author Heanes
 * @time 2015-09-17 14:20:49
 */
truncate `heanes.com`.`pre_wap_member_center_menu`;
insert into `heanes.com`.`pre_wap_member_center_menu` (
    `name`, `parent_id`, `group`, `a_href`, `a_target`, `icon_src`, `icon_src_hover`, `allow_read_role`, `create_time`, `order_number`, `is_enable`)
values
    ('申请贷款', '0', '1', '', 0, '', '.png', '.png', '1436471342', '1', '1')
    , ('贷款查询', '0', '1', '', 0, '', '.png', '.png', '1436471342', '2', '1')
    , ('我的贷款', '0', '1', '', 0, '', '.png', '.png', '1436471342', '3', '1')
    , ('', '0', '1', '', 0, '', '.png', '.png', '1436471342', '4', '1')
    , ('', '0', '1', '', 0, '', '.png', '.png', '1436471342', '4', '1')
    ##以下暂时不变
    , ('金宝街', '0', '1', '', 0, '', '.png', '.png', '1436471342', '4', '1')
    , ('收藏管理', '0', '1', '', 0, '', '.png', '.png', '1436471342', '4', '1')
    , ('产品收藏', '0', '1', '', 0, '', '.png', '.png', '1436471342', '4', '1')
    , ('积分商城收藏', '0', '1', '', 0, '', '.png', '.png', '1436471342', '4', '1')
    , ('文章收藏', '0', '1', '', 0, '', '.png', '.png', '1436471342', '4', '1')
    , ('帮助中心', '0', '1', '', 0, '', '.png', '.png', '1436471342', '4', '1')
    , ('投诉建议', '0', '1', '', 0, '', '.png', '.png', '1436471342', '4', '1')
    , ('联系我们', '0', '1', '', 0, '', '.png', '.png', '1436471342', '4', '1')
    , ('关于我们', '0', '1', '', 0, '', '.png', '.png', '1436471342', '4', '1')
    , ('设置', '0', '1', '', 0, '', '.png', '.png', '1436471342', '4', '1')
    , ('帐号与安全', '0', '1', '', 0, '', '.png', '.png', '1436471342', '4', '1')
    , ('关于', '0', '1', '', 0, '', '.png', '.png', '1436471342', '4', '1');

/**
 * @doc 导入用户数据
 * @author Heanes
 * @time 2015-07-05 00:39:58
 */
truncate `heanes.com`.`pre_users`;
insert into `heanes.com`.`pre_users` (
    `real_name`, `user_name`, `mobile`, `gender`, `role_id`, `user_pwd`, `reg_time`, `last_login_ip`, `is_enable`, `is_deleted`, `user_email`, `idcard`, `login_times`)
values
    ('周宏超', '周宏超', '15699997798', '1', '10', 'd6f19b13cc75b70cabe99ca6d92e5de7', '1362094066', '127.0.0.1', '5', '0', 'heanes@163.com', '', '1')
    , ('曹舒', '曹舒', '13261107321', '0', '9', 'd6f19b13cc75b70cabe99ca6d92e5de7', '1362094066', '127.0.0.1', '5', '0', '', '', '1')
    , ('李洪涛', '李洪涛', '18001136879', '1', '7', 'd6f19b13cc75b70cabe99ca6d92e5de7', '1362094066', '127.0.0.1', '5', '0', '', '', '1')
    , ('张瑞', '张瑞', '18911147736', '0', '7', 'd6f19b13cc75b70cabe99ca6d92e5de7', '1362094066', '127.0.0.1', '5', '0', '', '', '1')
    , ('司华锋', '华锋', '15210352970', '1', '5', 'd6f19b13cc75b70cabe99ca6d92e5de7', '1431629223', '118.186.239.65', '1', '0', '520_win@163.com', '411324198409145530', '1')
    , ('刘通', 'Financierliutong', '18001130650', '1', '2', 'd6f19b13cc75b70cabe99ca6d92e5de7', '1430848477', '60.10.97.238', '1', '0', 'liutong.china@outlook.com', '420683199301140377', '1')
    , ('蒲常莹', '蒲常莹', '151010286591', '0', '1', 'd6f19b13cc75b70cabe99ca6d92e5de7', '1429126709', '118.186.239.65', '1', '0', '2382427862@qq.com', '130681199209082245', '1')
    , ('方刚', '方刚', '15272028823', '1', '1', 'd6f19b13cc75b70cabe99ca6d92e5de7', '1430180380', '60.10.97.182', '1', '0', '137845848@qq.com', '421121199009187316', '1')
    , ('产品经理甲', '产品经理甲', '15010691715', '1', '5', 'd6f19b13cc75b70cabe99ca6d92e5de7', '1428950771', '118.186.239.65', '1', '0', '', '', '1')
    , ('产品经理乙', '产品经理乙', '15010691715', '1', '5', 'd6f19b13cc75b70cabe99ca6d92e5de7', '1428950771', '118.186.239.65', '1', '0', '', '', '1')
    , ('产品经理丙', '产品经理丙', '15010691715', '1', '5', 'd6f19b13cc75b70cabe99ca6d92e5de7', '1428950771', '118.186.239.65', '1', '0', '', '', '1')
    , ('产品经理丁', '产品经理丁', '15010691715', '1', '5', 'd6f19b13cc75b70cabe99ca6d92e5de7', '1428950771', '118.186.239.65', '1', '0', '', '', '1')
    , ('产品经理戊', '产品经理戊', '15010691715', '1', '5', 'd6f19b13cc75b70cabe99ca6d92e5de7', '1428950771', '118.186.239.65', '1', '0', '', '', '1')
    , ('产品经理己', '产品经理己', '15010691715', '1', '5', 'd6f19b13cc75b70cabe99ca6d92e5de7', '1428950771', '118.186.239.65', '1', '0', '', '', '1')
    , ('产品经理庚', '产品经理庚', '15010691715', '1', '5', 'd6f19b13cc75b70cabe99ca6d92e5de7', '1428950771', '118.186.239.65', '1', '0', '', '', '1')
    , ('产品经理辛', '产品经理辛', '15010691715', '1', '5', 'd6f19b13cc75b70cabe99ca6d92e5de7', '1428950771', '118.186.239.65', '1', '0', '', '', '1')
    , ('产品经理1', '产品经理1', '15010691715', '1', '5', 'd6f19b13cc75b70cabe99ca6d92e5de7', '1428950771', '118.186.239.65', '1', '0', '', '', '1')
    , ('产品经理2', '产品经理2', '15010691715', '1', '5', 'd6f19b13cc75b70cabe99ca6d92e5de7', '1428950771', '118.186.239.65', '1', '0', '', '', '1')
    , ('产品经理3', '产品经理3', '15010691715', '1', '5', 'd6f19b13cc75b70cabe99ca6d92e5de7', '1428950771', '118.186.239.65', '1', '0', '', '', '1')
    , ('产品经理4', '产品经理4', '15010691715', '1', '5', 'd6f19b13cc75b70cabe99ca6d92e5de7', '1428950771', '118.186.239.65', '1', '0', '', '', '1')
    , ('产品经理5', '产品经理5', '15010691715', '1', '5', 'd6f19b13cc75b70cabe99ca6d92e5de7', '1428950771', '118.186.239.65', '1', '0', '', '', '1')
    , ('产品经理6', '产品经理6', '15010691715', '1', '5', 'd6f19b13cc75b70cabe99ca6d92e5de7', '1428950771', '118.186.239.65', '1', '0', '', '', '1')
    , ('产品经理7', '产品经理7', '15010691715', '1', '5', 'd6f19b13cc75b70cabe99ca6d92e5de7', '1428950771', '118.186.239.65', '1', '0', '', '', '1')
    , ('产品经理8', '产品经理8', '15010691715', '1', '5', 'd6f19b13cc75b70cabe99ca6d92e5de7', '1428950771', '118.186.239.65', '1', '0', '', '', '1')
    , ('业务甲', '业务甲', '15010691715', '1', '3', 'd6f19b13cc75b70cabe99ca6d92e5de7', '1428950771', '118.186.239.65', '1', '0', '', '', '1')
    , ('业务乙', '业务乙', '15010691715', '1', '3', 'd6f19b13cc75b70cabe99ca6d92e5de7', '1428950771', '118.186.239.65', '1', '0', '', '', '1')
    , ('业务丙', '业务丙', '15010691715', '1', '3', 'd6f19b13cc75b70cabe99ca6d92e5de7', '1428950771', '118.186.239.65', '1', '0', '', '', '1')
    , ('业务丁', '业务丁', '15010691715', '1', '3', 'd6f19b13cc75b70cabe99ca6d92e5de7', '1428950771', '118.186.239.65', '1', '0', '', '', '1')
    , ('业务戊', '业务戊', '15010691715', '1', '3', 'd6f19b13cc75b70cabe99ca6d92e5de7', '1428950771', '118.186.239.65', '1', '0', '', '', '1')
    , ('业务己', '业务己', '15010691715', '1', '3', 'd6f19b13cc75b70cabe99ca6d92e5de7', '1428950771', '118.186.239.65', '1', '0', '', '', '1')
    , ('业务庚', '业务庚', '15010691715', '1', '3', 'd6f19b13cc75b70cabe99ca6d92e5de7', '1428950771', '118.186.239.65', '1', '0', '', '', '1')
    , ('业务辛', '业务辛', '15010691715', '1', '3', 'd6f19b13cc75b70cabe99ca6d92e5de7', '1428950771', '118.186.239.65', '1', '0', '', '', '1')
    , ('业务1', '业务1', '15010691715', '1', '3', 'd6f19b13cc75b70cabe99ca6d92e5de7', '1428950771', '118.186.239.65', '1', '0', '', '', '1')
    , ('业务2', '业务2', '15010691715', '1', '3', 'd6f19b13cc75b70cabe99ca6d92e5de7', '1428950771', '118.186.239.65', '1', '0', '', '', '1')
    , ('业务3', '业务3', '15010691715', '1', '3', 'd6f19b13cc75b70cabe99ca6d92e5de7', '1428950771', '118.186.239.65', '1', '0', '', '', '1')
    , ('业务4', '业务4', '15010691715', '1', '3', 'd6f19b13cc75b70cabe99ca6d92e5de7', '1428950771', '118.186.239.65', '1', '0', '', '', '1')
    , ('业务5', '业务5', '15010691715', '1', '3', 'd6f19b13cc75b70cabe99ca6d92e5de7', '1428950771', '118.186.239.65', '1', '0', '', '', '1')
    , ('业务6', '业务6', '15010691715', '1', '3', 'd6f19b13cc75b70cabe99ca6d92e5de7', '1428950771', '118.186.239.65', '1', '0', '', '', '1')
    , ('业务7', '业务7', '15010691715', '1', '3', 'd6f19b13cc75b70cabe99ca6d92e5de7', '1428950771', '118.186.239.65', '1', '0', '', '', '1')
    , ('业务8', '业务8', '15010691715', '1', '3', 'd6f19b13cc75b70cabe99ca6d92e5de7', '1428950771', '118.186.239.65', '1', '0', '', '', '1')
    , ('金鹰甲', '金鹰甲', '15010691715', '1', '2', 'd6f19b13cc75b70cabe99ca6d92e5de7', '1428950771', '118.186.239.65', '1', '0', '', '', '1')
    , ('金鹰乙', '金鹰乙', '15010691715', '1', '2', 'd6f19b13cc75b70cabe99ca6d92e5de7', '1428950771', '118.186.239.65', '1', '0', '', '', '1')
    , ('金鹰丙', '金鹰丙', '15010691715', '1', '2', 'd6f19b13cc75b70cabe99ca6d92e5de7', '1428950771', '118.186.239.65', '1', '0', '', '', '1')
    , ('金鹰丁', '金鹰丁', '15010691715', '1', '2', 'd6f19b13cc75b70cabe99ca6d92e5de7', '1428950771', '118.186.239.65', '1', '0', '', '', '1')
    , ('金鹰戊', '金鹰戊', '15010691715', '1', '2', 'd6f19b13cc75b70cabe99ca6d92e5de7', '1428950771', '118.186.239.65', '1', '0', '', '', '1')
    , ('金鹰己', '金鹰己', '15010691715', '1', '2', 'd6f19b13cc75b70cabe99ca6d92e5de7', '1428950771', '118.186.239.65', '1', '0', '', '', '1')
    , ('金鹰庚', '金鹰庚', '15010691715', '1', '2', 'd6f19b13cc75b70cabe99ca6d92e5de7', '1428950771', '118.186.239.65', '1', '0', '', '', '1')
    , ('金鹰辛', '金鹰辛', '15010691715', '1', '2', 'd6f19b13cc75b70cabe99ca6d92e5de7', '1428950771', '118.186.239.65', '1', '0', '', '', '1')
    , ('金鹰1', '金鹰1', '15010691715', '1', '2', 'd6f19b13cc75b70cabe99ca6d92e5de7', '1428950771', '118.186.239.65', '1', '0', '', '', '1')
    , ('金鹰2', '金鹰2', '15010691715', '1', '2', 'd6f19b13cc75b70cabe99ca6d92e5de7', '1428950771', '118.186.239.65', '1', '0', '', '', '1')
    , ('金鹰3', '金鹰3', '15010691715', '1', '2', 'd6f19b13cc75b70cabe99ca6d92e5de7', '1428950771', '118.186.239.65', '1', '0', '', '', '1')
    , ('金鹰4', '金鹰4', '15010691715', '1', '2', 'd6f19b13cc75b70cabe99ca6d92e5de7', '1428950771', '118.186.239.65', '1', '0', '', '', '1')
    , ('金鹰5', '金鹰5', '15010691715', '1', '2', 'd6f19b13cc75b70cabe99ca6d92e5de7', '1428950771', '118.186.239.65', '1', '0', '', '', '1')
    , ('金鹰6', '金鹰6', '15010691715', '1', '2', 'd6f19b13cc75b70cabe99ca6d92e5de7', '1428950771', '118.186.239.65', '1', '0', '', '', '1')
    , ('金鹰7', '金鹰7', '15010691715', '1', '2', 'd6f19b13cc75b70cabe99ca6d92e5de7', '1428950771', '118.186.239.65', '1', '0', '', '', '1')
    , ('金鹰8', '金鹰8', '15010691715', '1', '2', 'd6f19b13cc75b70cabe99ca6d92e5de7', '1428950771', '118.186.239.65', '1', '0', '', '', '1')
    , ('客户甲', '客户甲', '15010691715', '1', '1', 'd6f19b13cc75b70cabe99ca6d92e5de7', '1428950771', '118.186.239.65', '1', '0', '', '', '1')
    , ('客户乙', '客户乙', '15010691715', '1', '1', 'd6f19b13cc75b70cabe99ca6d92e5de7', '1428950771', '118.186.239.65', '1', '0', '', '', '1')
    , ('客户丙', '客户丙', '15010691715', '1', '1', 'd6f19b13cc75b70cabe99ca6d92e5de7', '1428950771', '118.186.239.65', '1', '0', '', '', '1')
    , ('客户丁', '客户丁', '15010691715', '1', '1', 'd6f19b13cc75b70cabe99ca6d92e5de7', '1428950771', '118.186.239.65', '1', '0', '', '', '1')
    , ('客户戊', '客户戊', '15010691715', '1', '1', 'd6f19b13cc75b70cabe99ca6d92e5de7', '1428950771', '118.186.239.65', '1', '0', '', '', '1')
    , ('客户己', '客户己', '15010691715', '1', '1', 'd6f19b13cc75b70cabe99ca6d92e5de7', '1428950771', '118.186.239.65', '1', '0', '', '', '1')
    , ('客户庚', '客户庚', '15010691715', '1', '1', 'd6f19b13cc75b70cabe99ca6d92e5de7', '1428950771', '118.186.239.65', '1', '0', '', '', '1')
    , ('客户辛', '客户辛', '15010691715', '1', '1', 'd6f19b13cc75b70cabe99ca6d92e5de7', '1428950771', '118.186.239.65', '1', '0', '', '', '1')
    , ('客户1', '客户1', '15010691715', '1', '1', 'd6f19b13cc75b70cabe99ca6d92e5de7', '1428950771', '118.186.239.65', '1', '0', '', '', '1')
    , ('客户2', '客户2', '15010691715', '1', '1', 'd6f19b13cc75b70cabe99ca6d92e5de7', '1428950771', '118.186.239.65', '1', '0', '', '', '1')
    , ('客户3', '客户3', '15010691715', '1', '1', 'd6f19b13cc75b70cabe99ca6d92e5de7', '1428950771', '118.186.239.65', '1', '0', '', '', '1')
    , ('客户4', '客户4', '15010691715', '1', '1', 'd6f19b13cc75b70cabe99ca6d92e5de7', '1428950771', '118.186.239.65', '1', '0', '', '', '1')
    , ('客户5', '客户5', '15010691715', '1', '1', 'd6f19b13cc75b70cabe99ca6d92e5de7', '1428950771', '118.186.239.65', '1', '0', '', '', '1')
    , ('客户6', '客户6', '15010691715', '1', '1', 'd6f19b13cc75b70cabe99ca6d92e5de7', '1428950771', '118.186.239.65', '1', '0', '', '', '1')
    , ('客户7', '客户7', '15010691715', '1', '1', 'd6f19b13cc75b70cabe99ca6d92e5de7', '1428950771', '118.186.239.65', '1', '0', '', '', '1')
    , ('客户8', '客户8', '15010691715', '1', '1', 'd6f19b13cc75b70cabe99ca6d92e5de7', '1428950771', '118.186.239.65', '1', '0', '', '', '1');
update `heanes.com`.`pre_users`
set `nickname` = `real_name`;

/**
 * @doc 用户角色
 * @author Heanes
 * @time 2015-07-20 11:08:18
 */
truncate `heanes.com`.`pre_user_role`;
insert into `pre_user_role` (
    `name`, `description`, `order_number`)
values
    ('普通会员', '普通会员', '1')
    , ('金鹰用户', '金鹰用户', '2')
    , ('客户经理', '业务员', '3')
    , ('部门经理', '部门经理', '4')
    , ('产品经理', '产品经理', '5')
    , ('客服', '客服', '6')
    , ('审核员', '审核员', '7')
    , ('人事经理', '人事综合管理', '8')
    , ('总经理', '老大', '9');

/**
 * @doc 用户权限库
 * @author Heanes
 * @time 2015-08-12 09:22:28
 */
truncate `heanes.com`.`pre_privilege_url`;
insert into `heanes.com`.`pre_privilege_url` (
    `name`, `class`, `method`, `description`, `create_time`)
values
    # 操作菜单
    ('操作菜单', 'menu', '', '链接菜单', '1428950771')#1
    , ('贷款管理', 'menu', 'borrow', '贷款管理菜单', '1428950771')#2
    , ('客户管理', 'menu', 'customer', '客户管理菜单', '1428950771')#3
    , ('金鹰管理', 'menu', 'employee', '金鹰管理菜单', '1428950771')#4
    , ('我的业绩', 'menu', 'performance', '我的业绩菜单', '1428950771')#5
    # 贷款对象
    , ('贷款对象', 'borrow', '', '贷款对象', '1428950771')#6
    , ('申请贷款', 'borrow', 'apply', '申请贷款', '1428950771')#7
    , ('我的贷款', 'borrow', 'mine', '我的贷款', '1428950771')#8
    , ('添加贷款', 'borrow', 'add', '添加贷款', '1428950771')#9
    , ('贷款记录', 'borrow', 'myList', '贷款记录', '1428950771')#10 针对用户自己
    , ('贷款统计', 'borrow', 'count', '贷款统计', '1428950771')#11
    , ('修改贷款信息', 'borrow', 'edit', '修改贷款信息', '1428950771')#12
    , ('删除贷款', 'borrow', 'delete', '删除贷款', '1428950771')#13
    # 客户对象
    , ('客户对象', 'customer', '', '客户管理', '1428950771')#14
    , ('查询客户', 'customer', 'search', '查询客户', '1428950771')#15
    , ('我的客户', 'customer', 'mine', '我的客户', '1428950771')#16
    , ('查看客户详情', 'customer', 'show', '查看客户详情', '1428950771')#17
    , ('添加客户页面', 'customer', 'add', '添加客户页面', '1428950771')#18
    , ('从注册用户添加为客户', 'customer', 'addFromExistsUser', '从注册用户添加为客户', '1428950771')#19
    , ('添加新用户资料为客户', 'customer', 'addFromNewUser', '添加新用户资料为客户', '1428950771')#20
    , ('修改客户信息', 'customer', 'edit', '修改客户信息', '1428950771')#21
    , ('删除客户', 'customer', 'delete', '删除客户', '1428950771')#22
    , ('客户统计', 'customer', 'count', '客户统计', '1428950771')#23
    # 金鹰对象
    , ('金鹰对象', 'employee', '', '金鹰管理', '1428950771')#24
    , ('申请金鹰', 'employee', 'apply', '申请金鹰', '1428950771')#25
    , ('查看金鹰信息', 'employee', 'show', '查看金鹰信息', '1428950771')#26
    , ('添加金鹰页面', 'employee', 'add', '添加客户页面', '1428950771')#27
    , ('添加金鹰（新用户形式）', 'employee', 'addFromNewUser', '添加金鹰', '1428950771')#28
    , ('添加金鹰（已注册用户形式）', 'employee', 'addFromExistsUser', '添加金鹰', '1428950771')#29
    , ('修改金鹰信息', 'employee', 'edit', '修改金鹰信息', '1428950771')#30
    , ('删除金鹰', 'employee', 'delete', '删除金鹰', '1428950771')#31
    , ('金鹰统计', 'employee', 'count', '金鹰统计', '1428950771')#32
    , ('我的上级', 'employee', 'myLeader', '我的上级', '1428950771')#33
    , ('金鹰推广', 'employee', 'invite', '金鹰推广', '1428950771')#34
;
/*
客户  : 申请贷款  查询贷款  申请金鹰
金鹰： 添加贷款  查询贷款  贷款统计
员工： 添加贷款  查询贷款  贷款统计 添加金鹰  金鹰统计 资料审核
部门经理 ：添加贷款  查询贷款  贷款统计 添加金鹰  金鹰统计 添加员工  员工统计 资料审核
产品经理 ：添加金鹰  金鹰统计 资料审核
*/
/**
 * @doc 用户权限添加
 * @author Heanes
 * @time 2015-07-27 09:48:03
 */
truncate `heanes.com`.`pre_user_privilege`;
insert into `pre_user_privilege` (
    `role_id`, `privilege_id`, `create_time`, `is_enable`)
values
    #-----------------普通会员角色
    #贷款对象
    ('1', '7', '1436918347', '1')
    , ('1', '8', '1436918347', '1')
    #金鹰对象
    , ('1', '25', '1436918347', '1')

    #-----------------金鹰用户角色
    #功能菜单
    , ('2', '2', '1436918347', '1')
    , ('2', '3', '1436918347', '1')
    , ('2', '4', '1436918347', '1')
    , ('2', '5', '1436918347', '1')
    #贷款对象
    #-申请功能
    , ('2', '7', '1436918347', '1')
    , ('2', '8', '1436918347', '1')
    #-管理功能

    #金鹰对象
    , ('2', '33', '1436918347', '1')
    , ('2', '34', '1436918347', '1')

    #-----------------客户经理角色
    #功能菜单
    , ('3', '2', '1436918347', '1')
    , ('3', '3', '1436918347', '1')
    , ('3', '4', '1436918347', '1')
    , ('3', '5', '1436918347', '1')
    #贷款对象
    #-申请功能
    , ('3', '7', '1436918347', '1')
    , ('3', '8', '1436918347', '1')
    #-管理功能

    #金鹰对象
    , ('3', '33', '1436918347', '1')
    , ('3', '34', '1436918347', '1')

    #-----------------总管理角色
    , ('9', '1', '1436918347', '1')
    , ('9', '2', '1436918347', '1')
    , ('9', '3', '1436918347', '1')
    , ('9', '4', '1436918347', '1')
    , ('9', '5', '1436918347', '1')
    , ('9', '6', '1436918347', '1')
    , ('9', '7', '1436918347', '1')
    , ('9', '8', '1436918347', '1')
    , ('9', '9', '1436918347', '1')
    , ('9', '10', '1436918347', '1')
    , ('9', '11', '1436918347', '1')
    , ('9', '12', '1436918347', '1')
    , ('9', '13', '1436918347', '1')
    , ('9', '14', '1436918347', '1')
    , ('9', '15', '1436918347', '1')
    , ('9', '16', '1436918347', '1')
    , ('9', '17', '1436918347', '1')
    , ('9', '18', '1436918347', '1')
    , ('9', '19', '1436918347', '1')
    , ('9', '20', '1436918347', '1')
    , ('9', '21', '1436918347', '1')
    , ('9', '22', '1436918347', '1')
    , ('9', '23', '1436918347', '1')
    , ('9', '24', '1436918347', '1')
    , ('9', '25', '1436918347', '1')
    , ('9', '26', '1436918347', '1')
    , ('9', '27', '1436918347', '1')
    , ('9', '28', '1436918347', '1')
    , ('9', '29', '1436918347', '1')
    , ('9', '30', '1436918347', '1')
    , ('9', '31', '1436918347', '1')
    , ('9', '32', '1436918347', '1')
    , ('9', '33', '1436918347', '1')
    , ('9', '34', '1436918347', '1');

/**
 * @doc 插入用户资产类型
 * @author Heanes
 * @time 2015-07-15 17:40:28
 */
truncate `heanes.com`.`pre_property`;
insert into `heanes.com`.`pre_property` (
    `name`, `order_number`, `add_show`, `is_required`, `create_time`, `is_enable`)
values
    ('个人房产', '1', '1', '0', '1436918347', '1')
    , ('个人车辆', '2', '1', '0', '1436918347', '1')
    , ('公司', '3', '1', '0', '1436918347', '1');

/**
 * @doc 插入用户资产类型字段
 * @author Heanes
 * @time 2015-07-15 17:40:28
 */
truncate `heanes.com`.`pre_property_fields`;
insert into `heanes.com`.`pre_property_fields` (
    `property_id`, `name`, `input_type`, `input_value`, `value_unit`, `add_show`, `is_required`, `order_number`, `create_time`, `update_time`, `is_enable`)
values
    ('1', '房产类型', 'select', '住宅房,商业房', null, '1', null, '1', '1436918347', '1436918347', '1')
    , ('1', '住房面积', 'text', null, '平', '1', null, '2', '1436918347', '1436918347', '1')
    , ('1', '所处地域', 'select-area', null, null, '1', null, '3', '1436918347', '1436918347', '1')
    , ('1', '详细地址', 'text', null, null, '1', null, '4', '1436918347', '1436918347', '1')
    , ('1', '房产证明第一页', 'file-image', null, null, '1', null, '5', '1436918347', '1436918347', '1')
    , ('1', '房产证明第二页', 'file-image', null, null, '1', null, '6', '1436918347', '1436918347', '1')
    , ('1', '房产证明第三页', 'file-image', null, null, '1', null, '7', '1436918347', '1436918347', '1')
    , ('3', '公司营业执照', 'file-image', null, null, '1', null, '1', '1436918347', '1436918347', '1')
    , ('3', '组织机构代码证', 'file-image', null, null, '1', null, '2', '1436918347', '1436918347', '1')
    , ('3', '税务登记证', 'file-image', null, null, '1', null, '3', '1436918347', '1436918347', '1')
    , ('2', '车牌号', 'text', null, null, '1', null, '1', '1436918347', '1436918347', '1');

/**
 * @doc 导入认证方式表
 * @author Heanes
 * @time 2015-07-06 16:45:03
 */
truncate `heanes.com`.`pre_certification_type`;
insert into `heanes.com`.`pre_certification_type` (
    `name`, `code`, `img_src`, `description`, `add_show`, `create_time`, `order_number`)
values
    ('身份认证', 'IDCard', 'ID.png', '用户实名认证，和真实身份证号挂钩', '1', '1436060529', '1')
    , ('邮件认证', 'email', 'Email.png', '用户注册关联邮件', '0', '1436060529', '2')
    , ('手机验证', 'mobile', 'Cellphone.png', '用户注册关联手机号', '0', '1436060529', '3')
    , ('实地认证', 'realAddress', 'Real_address.png', '用户线下居住地，厂房等实际地理方面的信息', '0', '1436060529', '4')
    , ('收入认证', 'income', 'income.png', '用户收人信息', '0', '1436060529', '5')
    , ('房产认证', 'house', 'House.png', '用户拥有的房产信息', '0', '1436060529', '6')
    , ('车产认证', 'car', 'Car.png', '用户拥有的车辆资产信息', '0', '1436060529', '7')
    , ('工作认证', 'job', 'Job.png', '用户是否有稳定工作', '0', '1436060529', '8');

/**
 * @doc 插入认证字段
 * @author Heanes
 * @time 2015-07-21 10:47:05
 */
truncate `heanes.com`.`pre_certification_type_fields`;
insert into `heanes.com`.`pre_certification_type_fields` (
    `name`, `type_id`, `input_type`, `input_value`, `value_unit`, `order_number`, `add_show`, `is_required`, `create_time`, `is_enable`)
values
    ('身份证号', '1', 'text', 'IDCard/demo_front.jpg', null, '1', '0', '0', '1436918347', '1')
    , ('身份证正面照片', '1', 'file-image', 'IDCard/demo_front.jpg', null, '2', '0', '0', '1436918347', '1')
    , ('身份证反面照片', '1', 'file-image', 'IDCard/demo_behind.jpg', null, '3', '0', '0', '1436918347', '1');

/**
 * @doc 导入部门表
 * @author Heanes
 * @time 2015-07-07 18:05:45
 */
truncate `heanes.com`.`pre_department`;
insert into `heanes.com`.`pre_department` (
    `name`, `english_name`, `description`, `manager_job_id`, `order_number`, `create_time`)
values
    ('总管理', 'manage', '老大', '8', '0', '1435908579')
    , ('综合管理部', 'manage', '综合管理部', '4', '1', '1436060433')
    , ('产品部', 'product', '产品部', '5', '2', '1436060433')
    , ('风控部', 'risk management', '风控部', '4', '3', '1436060433')
    , ('互联网金融技术部', 'technical', '互联网金融技术部，技术支持', '4', '4', '1436060433')
    , ('市场部一部', 'sales', '业务部的人很赚钱', '4', '5', '1436060433')
    , ('市场部二部', 'sales', '业务部的人很赚钱', '4', '6', '1436060433')
    , ('市场部二部', 'sales', '业务部的人很赚钱', '4', '7', '1436060433')
    , ('信贷事业部', 'credit loan', '信贷事业部', '4', '8', '1436060529');

insert into `heanes.com`.`pre_employee` (
    `user_id`, `department_id`, `job_id`, `create_time`, `apply_status`, `is_enable`)
values
    ('10001', '1', '1', '1437955056', '1', '1')
    , ('10002', '2', '1', '1437955056', '1', '1');

/**
 * @doc 导入职位信息
 * @author Heanes
 * @time 2015-07-13 09:35:43
 */
truncate `heanes.com`.`pre_job`;
insert into `heanes.com`.`pre_job` (
    `name`, `code`, `description`, `create_time`, `update_time`, `is_enable`)
values
    ('金鹰', 'partjober', '业务金鹰', '1436722450', '1436722450', '1')
    , ('客户经理', 'seller', '客户经理', '1436722450', '1436722450', '1')
    , ('高级客户经理', 'advanced-seller', '高级客户经理', '1436722450', '1436722450', '1')
    , ('部门经理', 'department-manager', '部门经理', '1436722450', '1436722450', '1')
    , ('产品经理', 'product-manager', '产品经理', '1436722450', '1436722450', '1')
    , ('程序员', 'programmer', '程序员', '1436722450', '1436722450', '1')
    , ('网站美工', 'web-designer', '网站美工', '1436722450', '1436722450', '1')
    , ('执行董事', 'executive-director', '执行董事', '1436722450', '1436722450', '1');

/**
 * @doc 插入客户数据
 * @author Heanes
 * @time 2015-08-14 14:16:22
 */
insert into `heanes.com`.`pre_customer` (
    `uid_master`, `uid_slave`, `create_time`, `apply_now`, `status`, `is_enable`)
values
    ('10001', '10057', '1428950771', '1', '1', '1')
    , ('10001', '10058', '1428950771', '1', '1', '1')
    , ('10001', '10059', '1428950771', '1', '1', '1')
    , ('10001', '10060', '1428950771', '1', '1', '1')
    , ('10001', '10061', '1428950771', '1', '1', '1')
    , ('10001', '10062', '1428950771', '1', '1', '1')
    , ('10001', '10063', '1428950771', '1', '1', '1')
    , ('10001', '10064', '1428950771', '1', '1', '1')
    , ('10001', '10065', '1428950771', '1', '1', '1')
    , ('10001', '10066', '1428950771', '1', '1', '1')
    , ('10001', '10067', '1428950771', '1', '1', '1')
    , ('10001', '10068', '1428950771', '1', '1', '1')
    , ('10001', '10069', '1428950771', '1', '1', '1')
    , ('10001', '10070', '1428950771', '1', '1', '1')
    , ('10001', '10071', '1428950771', '1', '1', '1')
    , ('10001', '10072', '1428950771', '1', '1', '1');

/**
 * @doc 导入产品信息
 * @author Heanes
 * @time 2015-07-16 12:34:31
 */
truncate `heanes.com`.`pre_product`;
insert into `heanes.com`.`pre_product` (
    `name`, `category_id`, `type_id`, `is_recommend`, `cover_img_src`, `short_desc`, `description`, `create_time`, `order_number`, `loan_type`)
values
    ('金企通', '1', '1', '1', '1.png', '(企业对公贷款) 行长推荐', '中小型企业的私人订制产品，提供担保、抵押、信用等多样化融资方式，解决中小企业的资金短缺等问题，助力中小企业直通成功！', '1436914750', '1', '企业对公贷款')
    , ('金易通', '1', '2', '1', '2.png', '（个人抵押经营、消费贷）行长推荐', '为小微企业和个人客户量身打造的专属产品，以抵押授信加理财的融资方式为私营业主提供绿色融资通道！', '1436914750', '2', '个人经营贷款')
    , ('薪贷通', '2', '3', '0', '3.png', '（工资信用贷）', '', '1436914750', '3', '工资信用贷')
    , ('期贷通', '2', '4', '0', '4.png', '（工资信用贷）', '', '1436914750', '4', '工资信用贷')
    , ('金贷通', '2', '5', '0', '5.png', '（公积金信用贷）', '', '1436914750', '5', '公积金信用贷')
    , ('社保通', '2', '6', '0', '6.png', '社保信用贷', '', '1436914750', '6', '社保信用贷')
    , ('保单通', '2', '7', '0', '7.png', '（保单信用贷）', '', '1436914750', '7', '保单信用贷')
    , ('白金卡A', '2', '8', '0', '8.png', '（高额信用卡，以公积金办卡）', '', '1436914750', '8', '高额信用卡，以公积金办卡')
    , ('生意通', '2', '9', '0', '9.png', '（银行企业信用贷）', '', '1436914750', '9', '银行企业信用贷')
    , ('全球通', '2', '10', '0', '10.png', '（出国信用贷）', '', '1436914750', '10', '出国信用贷')
    , ('Pos通', '2', '11', '0', '11.png', '（POS信用贷）', '', '1436914750', '11', 'POS信用贷')
    , ('白金卡B', '2', '12', '0', '8.png', '（高额信用卡，以房办卡）', '', '1436914750', '12', '高额信用卡，以房办卡')
    , ('白金卡C', '2', '13', '0', '8.png', '（高额信用卡，以卡办卡）', '', '1436914750', '13', '高额信用卡，以卡办卡')
    , ('白金卡D', '2', '14', '0', '8.png', '（高额信用卡，商圈办卡）', '', '1436914750', '14', '高额信用卡，商圈办卡')
    , ('机不可贷', '3', '15', '0', '15.png', '（小微企业信用贷）', '', '1436914750', '15', '小微企业信用贷')
    , ('车易通', '2', '16', '0', '16.png', '（押手续不押车）', '', '1436914750', '16', '车易通')
    , ('车易贷', '4', '17', '0', '17.png', '（押手续押车）', '', '1436914750', '17', '车易贷')
    , ('车主贷', '2', '18', '0', '18.png', '（车主信用贷） 特价', '', '1436914750', '18', '车主信用贷')
    , ('民品贷', '3', '19', '0', '19.png', '（民品抵押贷）', '', '1436914750', '19', '民品抵押贷')
    , ('房利美A', '3', '20', '0', '20.png', '（房产质押） 特价', '', '1436914750', '20', '房产质押')
    , ('房利美B', '3', '21', '0', '21.png', '（房产质押）', '', '1436914750', '21', '房产质押')
    , ('房利美C', '3', '22', '0', '22.png', '（房产质押）', '', '1436914750', '22', '房产质押')
    , ('闪垫贷', '2', '23', '0', '23.png', '（垫资）', '', '1436914750', '23', '垫资');

#产品分类
truncate `heanes.com`.`pre_product_category`;
insert into `heanes.com`.`pre_product_category` (
    `parent_id`, `name`, `img_src`, `create_time`, `order_number`)
values
    ('0', '<p style="text-align:center">银行</p><p style="text-align:center">抵押贷款</p>', '1.svg', '1436914750', '1')
    , ('0', '<p style="text-align:center">银行</p><p style="text-align:center">信用贷款</p>', '2.svg', '1436914750', '2')
    , ('0', '<p style="text-align:center">其他金融机构</p><p style="text-align:center">抵押贷款</p>', '3.svg', '1436914750', '3')
    , ('0', '<p style="text-align:center">其他金融机构</p><p style="text-align:center">信用贷款</p>', '4.svg', '1436914750', '4');
# 产品类型
truncate `heanes.com`.`pre_product_type`;
insert into `heanes.com`.`pre_product_type` (
    `name`, `description`, `create_time`, `order_number`)
values
    ('金企通', '金企通', '1436914750', '1')
    , ('金易通', '金易通', '1436914750', '1')
    , ('薪贷通', '全球通', '1436914750', '1')
    , ('期贷通', '期贷通', '1436914750', '1')
    , ('金贷通', '金贷通', '1436914750', '1')
    , ('社保通', '社保通', '1436914750', '1')
    , ('保单通', '保单通', '1436914750', '1')
    , ('白金卡A', '白金卡A', '1436914750', '1')
    , ('生意通', '生意通', '1436914750', '1')
    , ('全球通', '全球通', '1436914750', '1')
    , ('Pos通', 'Pos通', '1436914750', '1')
    , ('白金卡B', '白金卡B', '1436914750', '1')
    , ('白金卡C', '白金卡C', '1436914750', '1')
    , ('白金卡D', '白金卡D', '1436914750', '1')
    , ('机不可贷', '机不可贷', '1436914750', '1')
    , ('车易通', '车易通', '1436914750', '1')
    , ('车易贷', '车易贷', '1436914750', '1')
    , ('车主贷', '车主贷', '1436914750', '1')
    , ('民品贷', '民品贷', '1436914750', '1')
    , ('房利美A', '房利美A', '1436914750', '1')
    , ('房利美B', '房利美B', '1436914750', '1')
    , ('房利美C', '房利美C', '1436914750', '1')
    , ('闪垫贷', '闪垫贷', '1436914750', '1');
# 产品类型字段
truncate `heanes.com`.`pre_product_fields`;
insert into `heanes.com`.`pre_product_fields` (
    `type_id`, `name`, `input_type`, `input_value`, `allow_read_min_role_level`, `as_filter`, `is_show`, `order_number`, `is_enable`)
values
    ('1', '目标群体', 'text', null, '0', '0', '1', '1', '1')
    , ('1', '贷款额度', 'text', null, '0', '0', '1', '2', '1')
    , ('1', '贷款成数', 'text', null, '0', '0', '1', '3', '1')
    , ('1', '抵押物', 'text', null, '0', '0', '1', '4', '1')
    , ('1', '贷款利率', 'text', null, '0', '0', '1', '5', '1')
    , ('1', '贷款期限', 'text', null, '0', '0', '1', '6', '1')
    , ('1', '还款方式', 'text', null, '0', '0', '1', '7', '1')
    , ('1', '备注', 'text', null, '0', '0', '1', '8', '1')
    , ('1', '<span style="color:#f00;">最低服务费用</span>', 'textarea', null, '2', '0', '1', '9', '1')
    , ('1', '贷款机构', 'select', '银行贷款,其他贷款', '0', '1', '0', '10', '1')
    , ('1', '贷款类别', 'text', '抵押贷款,信用贷款', '0', '1', '0', '11', '1')

    , ('2', '目标群体', 'text', null, '0', '0', '1', '1', '1')
    , ('2', '贷款额度', 'text', null, '0', '0', '1', '2', '1')
    , ('2', '贷款成数', 'text', null, '0', '0', '1', '3', '1')
    , ('2', '抵押物', 'text', null, '0', '0', '1', '4', '1')
    , ('2', '贷款利率', 'text', null, '0', '0', '1', '5', '1')
    , ('2', '贷款期限', 'text', null, '0', '0', '1', '6', '1')
    , ('2', '还款方式', 'text', null, '0', '0', '1', '7', '1')
    , ('2', '产品特点', 'text', null, '0', '0', '1', '8', '1')
    , ('2', '<span style="color:#f00;">最低服务费用</span>', 'textarea', null, '2', '0', '1', '9', '1')
    , ('2', '贷款机构', 'select', '银行贷款,其他贷款', '0', '1', '0', '10', '1')
    , ('2', '贷款类别', 'text', '抵押贷款,信用贷款', '0', '1', '0', '11', '1')

    , ('3', '目标人群', 'text', null, '0', '0', '1', '1', '1')
    , ('3', '要求', 'text', null, '0', '0', '1', '1', '1')
    , ('3', '贷款额度', 'text', null, '0', '0', '1', '2', '1')
    , ('3', '授信期限', 'text', null, '0', '0', '1', '3', '1')
    , ('3', '贷款利率', 'text', null, '0', '0', '1', '4', '1')
    , ('3', '还款方式', 'text', null, '0', '0', '1', '5', '1')
    , ('3', '<span style="color:#f00;">最低服务费用</span>', 'textarea', null, '2', '0', '1', '7', '1')
    , ('3', '贷款机构', 'select', '银行贷款,其他贷款', '0', '1', '0', '8', '1')
    , ('3', '贷款类别', 'text', '抵押贷款,信用贷款', '0', '1', '0', '9', '1')

    , ('4', '目标群体', 'text', null, '0', '0', '1', '1', '1')
    , ('4', '要求', 'text', null, '0', '0', '1', '1', '1')
    , ('4', '贷款额度', 'text', null, '0', '0', '1', '2', '1')
    , ('4', '贷款利率', 'text', null, '0', '0', '1', '5', '1')
    , ('4', '授信期限', 'text', null, '0', '0', '1', '3', '1')
    , ('4', '还款方式', 'text', null, '0', '0', '1', '4', '1')
    , ('4', '<span style="color:#f00;">最低服务费用</span>', 'textarea', null, '2', '0', '1', '7', '1')
    , ('4', '贷款机构', 'select', '银行贷款,其他贷款', '0', '1', '0', '8', '1')
    , ('4', '贷款类别', 'text', '抵押贷款,信用贷款', '0', '1', '0', '9', '1')

    , ('5', '目标群体', 'text', null, '0', '0', '1', '1', '1')
    , ('5', '要求', 'text', null, '0', '0', '1', '1', '1')
    , ('5', '贷款额度', 'text', null, '0', '0', '1', '2', '1')
    , ('5', '贷款利率', 'text', null, '0', '0', '1', '5', '1')
    , ('5', '授信期限', 'text', null, '0', '0', '1', '3', '1')
    , ('5', '还款方式', 'text', null, '0', '0', '1', '4', '1')
    , ('5', '<span style="color:#f00;">最低服务费用</span>', 'textarea', null, '2', '0', '1', '7', '1')
    , ('5', '贷款机构', 'select', '银行贷款,其他贷款', '0', '1', '0', '8', '1')
    , ('5', '贷款类别', 'text', '抵押贷款,信用贷款', '0', '1', '0', '9', '1')

    , ('6', '目标人群', 'text', null, '0', '0', '1', '1', '1')
    , ('6', '要求', 'text', null, '0', '0', '1', '1', '1')
    , ('6', '贷款额度', 'text', null, '0', '0', '1', '2', '1')
    , ('6', '贷款利率', 'text', null, '0', '0', '1', '5', '1')
    , ('6', '授信期限', 'text', null, '0', '0', '1', '3', '1')
    , ('6', '还款方式', 'text', null, '0', '0', '1', '4', '1')
    , ('6', '<span style="color:#f00;">最低服务费用</span>', 'textarea', null, '2', '0', '1', '7', '1')
    , ('6', '贷款机构', 'select', '银行贷款,其他贷款', '0', '1', '0', '8', '1')
    , ('6', '贷款类别', 'text', '抵押贷款,信用贷款', '0', '1', '0', '9', '1')

    , ('7', '目标人群', 'text', null, '0', '0', '1', '1', '1')
    , ('7', '要求', 'text', null, '0', '0', '1', '2', '1')
    , ('7', '额度', 'text', null, '0', '0', '1', '3', '1')
    , ('7', '利率', 'text', null, '0', '0', '1', '4', '1')
    , ('7', '授信期限', 'text', null, '0', '0', '1', '5', '1')
    , ('7', '还款方式', 'text', null, '0', '0', '1', '6', '1')
    , ('7', '<span style="color:#f00;">最低服务费用</span>', 'textarea', null, '2', '0', '1', '7', '1')
    , ('7', '贷款机构', 'select', '银行贷款,其他贷款', '0', '1', '0', '8', '1')
    , ('7', '贷款类别', 'text', '抵押贷款,信用贷款', '0', '1', '0', '9', '1')

    , ('8', '目标人群', 'text', null, '0', '0', '1', '1', '1')
    , ('8', '要求', 'text', null, '0', '0', '1', '2', '1')
    , ('8', '额度', 'text', null, '0', '0', '1', '3', '1')
    , ('8', '利率', 'text', null, '0', '0', '1', '4', '1')
    , ('8', '年费', 'text', null, '0', '0', '1', '5', '1')
    , ('8', '备注', 'text', null, '0', '0', '1', '6', '1')
    , ('8', '<span style="color:#f00;">最低服务费用</span>', 'textarea', null, '2', '0', '1', '7', '1')
    , ('8', '贷款机构', 'select', '银行贷款,其他贷款', '0', '1', '0', '8', '1')
    , ('8', '贷款类别', 'text', '抵押贷款,信用贷款', '0', '1', '0', '9', '1')

    , ('9', '目标人群', 'text', null, '0', '0', '1', '1', '1')
    , ('9', '要求', 'text', null, '0', '0', '1', '2', '1')
    , ('9', '额度', 'text', null, '0', '0', '1', '3', '1')
    , ('9', '利率', 'text', null, '0', '0', '1', '4', '1')
    , ('9', '授信期限', 'text', null, '0', '0', '1', '5', '1')
    , ('9', '还款方式', 'text', null, '0', '0', '1', '6', '1')
    , ('9', '<span style="color:#f00;">最低服务费用</span>', 'textarea', null, '2', '0', '1', '7', '1')
    , ('9', '贷款机构', 'select', '银行贷款,其他贷款', '0', '1', '0', '8', '1')
    , ('9', '贷款类别', 'text', '抵押贷款,信用贷款', '0', '1', '0', '9', '1')

    , ('10', '目标人群', 'text', null, '0', '0', '1', '1', '1')
    , ('10', '额度', 'text', null, '0', '0', '1', '2', '1')
    , ('10', '授信期限', 'text', null, '0', '0', '1', '3', '1')
    , ('10', '利率', 'text', null, '0', '0', '1', '4', '1')
    , ('10', '还款方式', 'text', null, '0', '0', '1', '5', '1')
    , ('10', '<span style="color:#f00;">最低服务费用</span>', 'textarea', null, '2', '0', '1', '6', '1')
    , ('10', '贷款机构', 'select', '银行贷款,其他贷款', '0', '1', '0', '8', '1')
    , ('10', '贷款类别', 'text', '抵押贷款,信用贷款', '0', '1', '0', '9', '1')

    , ('11', '目标人群', 'text', null, '0', '0', '1', '1', '1')
    , ('11', '要求', 'text', null, '0', '0', '1', '2', '1')
    , ('11', '额度', 'text', null, '0', '0', '1', '3', '1')
    , ('11', '利率', 'text', null, '0', '0', '1', '4', '1')
    , ('11', '授信期限', 'text', null, '0', '0', '1', '5', '1')
    , ('11', '还款方式', 'text', null, '0', '0', '1', '5', '1')
    , ('11', '<span style="color:#f00;">最低服务费用</span>', 'textarea', null, '2', '0', '1', '7', '1')
    , ('11', '贷款机构', 'select', '银行贷款,其他贷款', '0', '1', '0', '8', '1')
    , ('11', '贷款类别', 'text', '抵押贷款,信用贷款', '0', '1', '0', '9', '1')

    , ('12', '目标人群', 'text', null, '0', '0', '1', '1', '1')
    , ('12', '要求', 'text', null, '0', '0', '1', '1', '1')
    , ('12', '额度', 'text', null, '0', '0', '1', '1', '1')
    , ('12', '利率', 'text', null, '0', '0', '1', '1', '1')
    , ('12', '年费', 'text', null, '0', '0', '1', '1', '1')
    , ('12', '备注', 'text', null, '0', '0', '1', '1', '1')
    , ('12', '<span style="color:#f00;">最低服务费用</span>', 'textarea', null, '2', '0', '1', '1', '1')
    , ('12', '贷款机构', 'select', '银行贷款,其他贷款', '0', '1', '0', '8', '1')
    , ('12', '贷款类别', 'text', '抵押贷款,信用贷款', '0', '1', '0', '9', '1')

    , ('13', '目标人群', 'text', null, '0', '0', '1', '1', '1')
    , ('13', '要求', 'text', null, '0', '0', '1', '1', '1')
    , ('13', '额度', 'text', null, '0', '0', '1', '1', '1')
    , ('13', '利率', 'text', null, '0', '0', '1', '1', '1')
    , ('13', '年费', 'text', null, '0', '0', '1', '1', '1')
    , ('13', '备注', 'text', null, '0', '0', '1', '1', '1')
    , ('13', '<span style="color:#f00;">最低服务费用</span>', 'textarea', null, '2', '0', '1', '1', '1')
    , ('13', '贷款机构', 'select', '银行贷款,其他贷款', '0', '1', '0', '8', '1')
    , ('13', '贷款类别', 'text', '抵押贷款,信用贷款', '0', '1', '0', '9', '1')

    , ('14', '目标人群', 'text', null, '0', '0', '1', '1', '1')
    , ('14', '要求', 'text', null, '0', '0', '1', '1', '1')
    , ('14', '额度', 'text', null, '0', '0', '1', '1', '1')
    , ('14', '利率', 'text', null, '0', '0', '1', '1', '1')
    , ('14', '年费', 'text', null, '0', '0', '1', '1', '1')
    , ('14', '备注', 'text', null, '0', '0', '1', '1', '1')
    , ('14', '<span style="color:#f00;">最低服务费用</span>', 'textarea', null, '2', '0', '1', '1', '1')
    , ('14', '贷款机构', 'select', '银行贷款,其他贷款', '0', '1', '0', '8', '1')
    , ('14', '贷款类别', 'text', '抵押贷款,信用贷款', '0', '1', '0', '9', '1')

    , ('15', '目标人群', 'text', null, '0', '0', '1', '1', '1')
    , ('15', '要求', 'text', null, '0', '0', '1', '1', '1')
    , ('15', '额度', 'text', null, '0', '0', '1', '1', '1')
    , ('15', '利息', 'text', null, '0', '0', '1', '1', '1')
    , ('15', '还款方式', 'text', null, '0', '0', '1', '1', '1')
    , ('15', '授信期限', 'text', null, '0', '0', '1', '1', '1')
    , ('15', '<span style="color:#f00;">最低服务费用</span>', 'textarea', null, '2', '0', '1', '1', '1')
    , ('15', '贷款机构', 'select', '银行贷款,其他贷款', '0', '1', '0', '8', '1')
    , ('15', '贷款类别', 'text', '抵押贷款,信用贷款', '0', '1', '0', '9', '1')

    , ('16', '目标人群', 'text', null, '0', '0', '1', '1', '1')
    , ('16', '要求', 'text', null, '0', '0', '1', '1', '1')
    , ('16', '额度', 'text', null, '0', '0', '1', '1', '1')
    , ('16', '利率', 'text', null, '0', '0', '1', '1', '1')
    , ('16', '期限', 'text', null, '0', '0', '1', '1', '1')
    , ('16', '还款方式', 'text', null, '0', '0', '1', '1', '1')
    , ('16', '备注', 'text', null, '0', '0', '1', '1', '1')
    , ('16', '<span style="color:#f00;">最低服务费用</span>', 'textarea', null, '2', '0', '1', '1', '1')
    , ('16', '贷款机构', 'select', '银行贷款,其他贷款', '0', '1', '0', '8', '1')
    , ('16', '贷款类别', 'text', '抵押贷款,信用贷款', '0', '1', '0', '9', '1')

    , ('17', '目标人群', 'text', null, '0', '0', '1', '7', '1')
    , ('17', '要求', 'text', null, '0', '0', '1', '1', '1')
    , ('17', '额度', 'text', null, '0', '0', '1', '1', '1')
    , ('17', '利率', 'text', null, '0', '0', '1', '1', '1')
    , ('17', '期限', 'text', null, '0', '0', '1', '1', '1')
    , ('17', '还款方式', 'text', null, '0', '0', '1', '1', '1')
    , ('17', '备注', 'text', null, '0', '0', '1', '1', '1')
    , ('17', '<span style="color:#f00;">最低服务费用</span>', 'textarea', null, '2', '0', '1', '1', '1')
    , ('17', '贷款机构', 'select', '银行贷款,其他贷款', '0', '1', '0', '8', '1')
    , ('17', '贷款类别', 'text', '抵押贷款,信用贷款', '0', '1', '0', '9', '1')

    , ('18', '目标人群', 'text', null, '0', '0', '1', '1', '1')
    , ('18', '要求', 'text', null, '0', '0', '1', '1', '1')
    , ('18', '额度', 'text', null, '0', '0', '1', '1', '1')
    , ('18', '利率', 'text', null, '0', '0', '1', '1', '1')
    , ('18', '期限', 'text', null, '0', '0', '1', '1', '1')
    , ('18', '还款方式', 'text', null, '0', '0', '1', '1', '1')
    , ('18', '备注', 'text', null, '0', '0', '1', '1', '1')
    , ('18', '<span style="color:#f00;">最低服务费用</span>', 'textarea', null, '2', '0', '1', '1', '1')
    , ('18', '贷款机构', 'select', '银行贷款,其他贷款', '0', '1', '0', '8', '1')
    , ('18', '贷款类别', 'text', '抵押贷款,信用贷款', '0', '1', '0', '9', '1')

    , ('19', '目标人群', 'text', null, '0', '0', '1', '1', '1')
    , ('19', '要求', 'text', null, '0', '0', '1', '1', '1')
    , ('19', '额度', 'text', null, '0', '0', '1', '1', '1')
    , ('19', '利率', 'text', null, '0', '0', '1', '1', '1')
    , ('19', '所需资料', 'text', null, '0', '0', '1', '1', '1')
    , ('19', '<span style="color:#f00;">最低服务费用</span>', 'textarea', null, '2', '0', '1', '1', '1')
    , ('19', '贷款机构', 'select', '银行贷款,其他贷款', '0', '1', '0', '8', '1')
    , ('19', '贷款类别', 'text', '抵押贷款,信用贷款', '0', '1', '0', '9', '1')

    , ('20', '目标人群', 'text', null, '0', '0', '1', '1', '1')
    , ('20', '要求', 'text', null, '0', '0', '1', '1', '1')
    , ('20', '抵押物', 'text', null, '0', '0', '1', '1', '1')
    , ('20', '额度', 'text', null, '0', '0', '1', '1', '1')
    , ('20', '成数', 'text', null, '0', '0', '1', '1', '1')
    , ('20', '利率', 'text', null, '0', '0', '1', '1', '1')
    , ('20', '期限', 'text', null, '0', '0', '1', '1', '1')
    , ('20', '产品特点', 'text', null, '0', '0', '1', '1', '1')
    , ('20', '<span style="color:#f00;">最低服务费用</span>', 'textarea', null, '2', '0', '1', '1', '1')
    , ('20', '贷款机构', 'select', '银行贷款,其他贷款', '0', '1', '0', '8', '1')
    , ('20', '贷款类别', 'text', '抵押贷款,信用贷款', '0', '1', '0', '9', '1')

    , ('21', '目标人群', 'text', null, '0', '0', '1', '1', '1')
    , ('21', '要求', 'text', null, '0', '0', '1', '1', '1')
    , ('21', '额度', 'text', null, '0', '0', '1', '1', '1')
    , ('21', '利率', 'text', null, '0', '0', '1', '1', '1')
    , ('21', '期限', 'text', null, '0', '0', '1', '1', '1')
    , ('21', '还款方式', 'text', null, '0', '0', '1', '1', '1')
    , ('21', '放款时间', 'text', null, '0', '0', '1', '1', '1')
    , ('21', '<span style="color:#f00;">最低服务费用</span>', 'textarea', null, '2', '0', '1', '1', '1')
    , ('21', '贷款机构', 'select', '银行贷款,其他贷款', '0', '1', '0', '8', '1')
    , ('21', '贷款类别', 'text', '抵押贷款,信用贷款', '0', '1', '0', '9', '1')

    , ('22', '目标人群', 'text', null, '0', '0', '1', '1', '1')
    , ('22', '要求', 'text', null, '0', '0', '1', '1', '1')
    , ('22', '额度', 'text', null, '0', '0', '1', '1', '1')
    , ('22', '期限', 'text', null, '0', '0', '1', '1', '1')
    , ('22', '还款方式', 'text', null, '0', '0', '1', '1', '1')
    , ('22', '利率', 'text', null, '0', '0', '1', '1', '1')
    , ('22', '放款时间', 'text', null, '0', '0', '1', '1', '1')
    , ('22', '<span style="color:#f00;">最低服务费用</span>', 'textarea', null, '2', '0', '1', '1', '1')
    , ('22', '贷款机构', 'select', '银行贷款,其他贷款', '0', '1', '0', '8', '1')
    , ('22', '贷款类别', 'text', '抵押贷款,信用贷款', '0', '1', '0', '9', '1')

    , ('23', '目标人群', 'text', null, '0', '0', '1', '1', '1')
    , ('23', '要求', 'text', null, '0', '0', '1', '1', '1')
    , ('23', '额度', 'text', null, '0', '0', '1', '1', '1')
    , ('23', '利率', 'text', null, '0', '0', '1', '1', '1')
    , ('23', '<span style="color:#f00;">最低服务费用</span>', 'textarea', null, '2', '0', '1', '1', '1')
    , ('23', '贷款机构', 'select', '银行贷款,其他贷款', '0', '1', '0', '8', '1')
    , ('23', '贷款类别', 'text', '抵押贷款,信用贷款', '0', '1', '0', '9', '1');

# 产品属性
truncate `heanes.com`.`pre_product_fields_data`;
insert into `heanes.com`.`pre_product_fields_data` (
    `fields_id`, `product_id`, `fields_value`)
values
    ('1', '1', '在京注册满一年以上且征信良好的法人企业')
    , ('2', '1', '1000万至1亿')
    , ('3', '1', '可贷抵押物评估值的50%至90%')
    , ('4', '1', '全国范围内可上市交易的固定资产（如住宅、经适房、别墅、写字楼、商铺、土地、厂房等），存货、原材料、订单、专利、纳税等')
    , ('5', '1', '年息5.1%至6.12%（优质企业可以享受贴息）')
    , ('6', '1', '1+1模式')
    , ('7', '1', '季度付息年还本')
    , ('8', '1', '成数高，批款快，额度充裕，针对不同行业设计灵活的融资方案和还款方式，专业的审批团队，标准化的操作流程来解决企业的资金')
    , ('9', '1', '<span style="color:#f00;">0.6%</span> 京津冀企业都可放款')
    , ('10', '1', '银行贷款')
    , ('11', '1', '抵押贷款')

    , ('12', '2', '在京有房且征信良好的企业主')
    , ('13', '2', '50万到2000万')
    , ('14', '2', '可贷抵押物评估值的50%至80%')
    , ('15', '2', '企业名下或法人、股东名下以及第三方名下的可在京上市交易的房产（如住宅、经适房、别墅、写字楼、商铺）')
    , ('16', '2', '年息5.355%至6.63%（优质客户利息可以抵扣）')
    , ('17', '2', '1到5年')
    , ('18', '2', '月付息，到期还本，年底不用还本金。')
    , ('19', '2', '融资易、放款快、成本低，贷款申请简便，审批快捷，还款方式接地气，不仅让客户做到不差钱，还可以以贷赚钱！')
    , ('20', '2', '<span style="color:#f00;">0.3%</span>各种疑难，全面接单')
    , ('21', '2', '银行贷款')
    , ('22', '2', '抵押贷款')

    , ('23', '3', '在京有稳定职业，工资以打卡形式发放')
    , ('24', '3', '征信良好，现单位满三个月，打卡工资每月不低于5000元人民币')
    , ('25', '3', '5万至50万')
    , ('26', '3', '3个月至5年')
    , ('27', '3', '年息9%—18%')
    , ('28', '3', '等额本息')
    , ('29', '3', '<span style="color:#f00;">2%</span>')
    , ('30', '3', '银行贷款')
    , ('31', '3', '信用贷款')

    , ('32', '4', '在京有车贷或全国范围内有房贷')
    , ('33', '4', '征信良好，已还房贷或车贷满半年')
    , ('34', '4', '5万至50万')
    , ('35', '4', '年息10.8%—11.4%')
    , ('36', '4', '1年至3年')
    , ('37', '4', '等额本息')
    , ('38', '4', '<span style="color:#f00;">2%</span>')
    , ('39', '4', '银行贷款')
    , ('40', '4', '信用贷款')

    , ('41', '5', '在京有稳定职业，公积金连续缴存超过1年')
    , ('42', '5', '征信良好，年龄20—55周岁，公积金缴存满1年')
    , ('43', '5', '5万至50万')
    , ('44', '5', '年7.2%—12%')
    , ('45', '5', '1至3年')
    , ('46', '5', '等额本息')
    , ('47', '5', '<span style="color:#f00;">2%</span>')
    , ('48', '5', '银行贷款')
    , ('49', '5', '信用贷款')

    , ('50', '6', '在京有稳定的职业，社保连续缴存满1年')
    , ('51', '6', '征信良好，年龄20—55周岁，在京社保缴存满1年')
    , ('52', '6', '5万至50万')
    , ('53', '6', '年息7.2%—12%')
    , ('54', '6', '1年至3年')
    , ('55', '6', '等额本息')
    , ('56', '6', '<span style="color:#f00;">2%</span>')
    , ('57', '6', '银行贷款')
    , ('58', '6', '信用贷款')

    , ('59', '7', '平安、中国人寿、新华、泰康、中国人民寿险公司的寿险投保人')
    , ('60', '7', '投保人缴存满三年，期间按时交纳保费；在所缴纳保费的保险公司没有做过贷款')
    , ('61', '7', '3万至50万')
    , ('62', '7', '年息10.7%')
    , ('63', '7', '1年至3年')
    , ('64', '7', '等额本息')
    , ('65', '7', '<span style="color:#f00;">2%</span>')
    , ('66', '7', '银行贷款')
    , ('67', '7', '信用贷款')

    , ('68', '8', '在京有稳定的职业，缴存公积金满一年')
    , ('69', '8', '个人在京缴存公积金满800元，且连续1年以上；年龄25—50岁；当前无逾期。')
    , ('70', '8', '9万至50万')
    , ('71', '8', '每天万分之五')
    , ('72', '8', '1888元，刷够20万免年费')
    , ('73', '8', '保批9万以上')
    , ('74', '8', '<span style="color:#f00;">5%</span>')
    , ('75', '8', '银行贷款')
    , ('76', '8', '信用贷款')

    , ('77', '9', '在京注册满一年的法人企业、个体工商户')
    , ('78', '9', '商圈内企业或在京有房，年流水满300万以上')
    , ('79', '9', '5万至200万')
    , ('80', '9', '年息7%至15%')
    , ('81', '9', '1年至5年')
    , ('82', '9', '等额本息或先息后本')
    , ('83', '9', '<span style="color:#f00;">2%</span>')
    , ('84', '9', '银行贷款')
    , ('85', '9', '信用贷款')

    , ('86', '10', '预备出国留学、旅游、移民的老板')
    , ('87', '10', '5万到100万')
    , ('88', '10', '1年至3年')
    , ('89', '10', '年息8%')
    , ('90', '10', '月付息，年还本')
    , ('91', '10', '<span style="color:#f00;">2%</span>')
    , ('92', '10', '银行贷款')
    , ('93', '10', '信用贷款')

    , ('94', '11', '月付息，年还本')
    , ('95', '11', '在京有房注册满一年，用POS收单')
    , ('96', '11', '10万至300万')
    , ('97', '11', '每天万分之五')
    , ('98', '11', '1年至10年')
    , ('99', '11', '等额本息')
    , ('100', '11', '<span style="color:#f00;">2%</span>')
    , ('101', '11', '银行贷款')
    , ('102', '11', '信用贷款')

    , ('103', '12', '在京有可上市交易得房产的老板')
    , ('104', '12', '夫妻名下在京有商品房，年龄25—65岁内，无房本可提供购房合同和发票')
    , ('105', '12', '9万至30万')
    , ('106', '12', '每天万分之五')
    , ('107', '12', '1888元，刷够20万免年费')
    , ('108', '12', '保批9万以上')
    , ('109', '12', '<span style="color:#f00;">5%</span>')
    , ('110', '12', '银行贷款')
    , ('111', '12', '信用贷款')

    , ('112', '13', '有五万以上的信用卡的老板')
    , ('113', '13', '五万信用卡满一年，十万信用卡满半年即可；年龄25—65岁内')
    , ('114', '13', '9万至30万')
    , ('115', '13', '每天万分之五')
    , ('116', '13', '1888元，刷够20万免年费')
    , ('117', '13', '保批9万以上')
    , ('118', '13', '<span style="color:#f00;">5%</span>')
    , ('119', '13', '银行贷款')
    , ('120', '13', '信用贷款')

    , ('121', '14', '商圈内的企业主')
    , ('122', '14', '市场成立满2年，营业执照需满2年，变更本人名下满1年；注册地址与经营地点不一致，需提供一年以上的租赁合同')
    , ('123', '14', '5—9.9万')
    , ('124', '14', '每天万分之五')
    , ('125', '14', '0')
    , ('126', '14', '保批5万以上')
    , ('127', '14', '<span style="color:#f00;">5%</span>')
    , ('128', '14', '银行贷款')
    , ('129', '14', '信用贷款')

    , ('130', '15', '在京注册满一年的企业股东、法人')
    , ('131', '15', '公司成立满一年且变更满一年；营业额半年达到300万以上；贷款人占股20%以上；夫妻名下必须有房（全国范围内的住宅、办公、别墅、小产权、经适房、自建房等均可）；销售额与销售凭证要匹配；年龄：25—60岁')
    , ('132', '15', '5万至60万')
    , ('133', '15', '月息1.7%')
    , ('134', '15', '先息后本')
    , ('135', '15', '6个月至2年')
    , ('136', '15', '<span style="color:#f00;">2%</span>')
    , ('137', '15', '其他贷款')
    , ('138', '15', '抵押贷款')

    , ('139', '16', '京牌车车主')
    , ('140', '16', '6个月—5年行驶10万公里以内的京牌车，车辆价值在8万以上，9座以下自用车上牌且未抵押车辆（银行有抵需还清，抵给民间或个人，需还清三个月后方能操作）；年龄25—55周岁；信用记录良好，以下条件满足一项即可：1.北京户籍2.在京有房3.在京注册企业满一年4.在京打卡工资满一年')
    , ('141', '16', '5万—50万，车辆价值的6成至7成')
    , ('142', '16', '年息10%至12%')
    , ('143', '16', '1年至3年')
    , ('144', '16', '等额本息；满八个月可提前结清')
    , ('145', '16', '当天放款')
    , ('146', '16', '<span style="color:#f00;">3%</span>')
    , ('147', '16', '其他贷款')
    , ('148', '16', '抵押贷款')

    , ('149', '17', '京牌车车主')
    , ('150', '17', '8年之内20万公里内的没有法律纠纷的京牌七座以内非营运全款车，且年检、交强险都在有效期；18—65周岁具有完全行为能力的中国大陆籍自然人；')
    , ('151', '17', '车值的8成')
    , ('152', '17', '月利率2%')
    , ('153', '17', '1—3个月')
    , ('154', '17', '先息后本')
    , ('155', '17', '当天放款')
    , ('156', '17', '<span style="color:#f00;">5%</span>')
    , ('157', '17', '其他贷款')
    , ('158', '17', '抵押贷款')

    , ('159', '18', '全国范围内的私家车主，出租车主')
    , ('160', '18', '征信近一年不能连3累6；借款人近半年流水是月还款的2—4倍；以下条件满足一项即可： 1.北京牌照 2.北京户口 3.在京有房')
    , ('161', '18', '1万至20万')
    , ('162', '18', '1.98%（另有家访费500元；GPS费用800元）')
    , ('163', '18', '3期至24期')
    , ('164', '18', '等额本息')
    , ('165', '18', '外地牌照、运营车、分期车均可，当天放款，不押车，不押手续')
    , ('166', '18', '<span style="color:#f00;">1%</span>')
    , ('167', '18', '银行贷款')
    , ('168', '18', '信用贷款')

    , ('169', '19', '18-65周岁，具有完全行为能力的中国大陆的自然人，港澳台居民、外国人需提供港澳通行证和护照。')
    , ('170', '19', '必须符合公司进件产品，非偷盗等违禁物品，来源为正常渠道。信用追加：必须符合信审进件准则')
    , ('171', '19', '根据实物评定')
    , ('172', '19', '7天1.5%；15天2.5%；1期4%；2期3.8%；3期3.5%')
    , ('173', '19', '借款人身份证、财力证明、工作证明、收入证明、征信报告 (非本地需要暂住证)')
    , ('174', '19', '<span style="color:#f00;">2%</span>')
    , ('175', '19', '其他贷款')
    , ('176', '19', '抵押贷款')

    , ('178', '20', '在京有房的个人或企业')
    , ('179', '20', '可在京上市交易的房产（如住宅、经适房、别墅、写字楼、商铺、土地、厂房等）')
    , ('180', '20', '单笔50万至1000万')
    , ('181', '20', '最高8成')
    , ('182', '20', '月息1.5%')
    , ('183', '20', '1至6个月')
    , ('184', '20', '不看流水、不看征信，流程简单，当天放款')
    , ('185', '20', '<span style="color:#f00;">活动期间免费</span>')
    , ('186', '20', '其他贷款')
    , ('187', '20', '抵押贷款')

    , ('188', '21', '活动期间免费')
    , ('189', '21', '征信良好，北京房龄20年以内，土地性质为出让，建筑面积不超300㎡；中国籍18—65周岁；借款人为企业法人、股东、实际控制人，实际借款人为房屋产权人；企业注册满一年，提供二套房产（全国范围内的住宅、办公、小产权、自建房等均可）')
    , ('190', '21', '50万至500万；评估值的70%')
    , ('191', '21', '月息1.583%+1%本金')
    , ('192', '21', '1年至3年')
    , ('193', '21', '先息后本')
    , ('194', '21', '自收客户资料之日起，5—9个工作日')
    , ('195', '21', '<span style="color:#f00;">2%</span>')
    , ('196', '21', '其他贷款')
    , ('197', '21', '抵押贷款')

    , ('198', '22', '在京有可上市交易的商品房')
    , ('199', '22', '征信良好，具备还款能力的18—65岁内的授薪人士、个体户、企业主；房龄不超过30年的在京大产权可上市交易的房产（平谷、怀柔、密云、延庆除外）；产权共有人须全部到场')
    , ('200', '22', '15万—1000万（房值的5至7成）')
    , ('201', '22', '2至6个月')
    , ('202', '22', '先息后本')
    , ('203', '22', '月息1.5%')
    , ('204', '22', '见抵押登记回执即可放款')
    , ('205', '22', '<span style="color:#f00;">0</span>')
    , ('206', '22', '银行贷款')
    , ('207', '22', '信用贷款')

    , ('208', '23', '在京所申请的房屋抵押贷款已经批贷')
    , ('209', '23', '在京所申请的房屋抵押贷款已出批贷函；需收押原件；核行；公证')
    , ('210', '23', '10万—1000万')
    , ('211', '23', '10天1.2%，20天1.7%，30天2.2%')
    , ('212', '23', '<span style="color:#f00;">0</span>')
    , ('213', '23', '银行贷款')
    , ('214', '23', '信用贷款');

/**
 * @doc 导入文章分类数据
 * @author Heanes
 * @time 2015-08-11 14:51:08
 */
truncate `heanes.com`.`pre_article_category`;
insert into `heanes.com`.`pre_article_category` (
    `parent_id`, `name`, `code`, `create_time`, `order_number`, `is_enable`)
values
    ('0', '最新资讯', 'news', '1356389066', '1', '1')#1
    , ('0', '网站公告', 'notice', '1356389066', '2', '1')#2
    , ('0', '最新奖励', 'newReward', '1356389066', '3', '1')#3
    , ('0', '关于我们', 'aboutUs', '1356389066', '4', '1')#4
    , ('0', '帮助中心', 'help', '1356389066', '5', '1')#5
    , ('0', '招贤纳士', 'joinUs', '1356389066', '6', '1')#6
    , ('0', '业绩报告', 'performanceReport', '1356389066', '7', '1')#7
;
/**
 * @doc 导入文章内容数据
 * @author Heanes
 * @time 2015-06-23 18:07:23
 */
truncate `heanes.com`.`pre_article`;
insert into `heanes.com`.`pre_article` (
    `category_id`, `title`, `subtitle`, `cover_img_src`, `user_id`, `user_link`, `author`, `editor`, `origin_source`, `content`, `keywords`, `tags`, `semantic_a_href`, `a_href`, `a_title`, `title_bg_color`, `content_bg_color`, `template_id`, `is_new`, `is_recommend`, `is_top`, `is_great`, `is_deleted`, `allow_comment`, `comment_num`, `comment_score`, `read_num`, `click_count`, `seo_title`, `seo_keywords`, `seo_description`, `user_role_id`, `user_rank`, `access_password`, `create_time`, `update_time`, `order_number`, `is_enable`)
values
    ('2', '你好，世界！', '', '1.jpg', '0', null, null, null, null, '<p>自豪的使用自己编写的博客</p>', '金乐汇,贷款', null, '', null, null, '#FFF', '#FFF', null, '1', '1', '0', '0', '0', '1', '0', '5', '1', '113', '金乐汇上线公告', '金乐汇，', '', null, null, null,
     '1356389066', '1431562309', null, '1');

/**
 * @doc 专题页面
 * @author Heanes
 * @time 2015-08-26 15:16:10
 */
truncate `heanes.com`.`pre_special`;
insert into `heanes.com`.`pre_special` (
    `title`, `subtitle`, `semantic_a_href`, `a_href`, `template_path`, `template_file`, `create_time`)
values
    ('业之家', '创业之家', '/wap/index.php?act=employee&op=partjober', '/wap/index.php?act=employee&op=partjober', 'partjober', 'scrollPage', '1440637673');

truncate `heanes.com`.`pre_ware`;
alter table `heanes.com`.`pre_ware`
    auto_increment = 100001;
insert into `heanes.com`.`pre_ware` (
    `category_id`, `name`, `shop_price`, `original_price`, `store_num`, `total_sold_num`, `cover_img_src`, `description`, `create_time`, `order_number`, `is_enable`)
values
    ('1', '锅碗瓢盆任你挑任你选，破的不要钱，旧的白送，假的买一赔三', '999', '1099', '471', '23', '1.jpg', '<a><img src="/data/upload/image/ware/100001/album/1.jpg"></a>', '1440637673', '1', '1')
    , ('1', '正品304不锈钢真空户外旅行壶大容量保温杯宝宝泡奶杯保温壶包邮', '179', '259', '361', '56', '1.jpg', '<a><img src="/data/upload/image/ware/100002/album/1.jpg"></a>', '1440637673', '2', '1')
    , ('1', 'Midea/美的 MK-TM1502电热水壶烧水开水壶保温不锈钢随手泡大容量', '269', '319', '99', '74', '1.jpg', '<a><img src="/data/upload/image/ware/100002/album/1.jpg"></a>', '1440637673', '3', '1')
    , ('1', '飞利浦电动剃须刀YQ6008男士充电式三刀头剃须刮胡刀刀头水洗正品', '349', '389', '17', '29', '1.jpg', '<a><img src="/data/upload/image/ware/100002/album/1.jpg"></a>', '1440637673', '4', '1');

#================================================库类数据导入=============================================#
/**
 * @doc 银行卡库
 * @author Heanes
 * @time 2015-07-29 10:16:47
 */
truncate `heanes.com`.`pre_bank`;
insert into `heanes.com`.`pre_bank` (
    `name`, `code`, `img_url`, `a_href`, `create_time`, `update_time`)
values
    ('工商银行', 'ICBC', 'ICBC.jpg', 'http://www.icbc.com.cn/icbc/', '1436471342', '1436471342')
    , ('中国银行', 'BOC', 'BOC.jpg', 'http://www.boc.cn/', '1436471342', '1436471342')
    , ('中国农业银行', 'ABC', 'ABC.jpg', 'http://www.abchina.com/cn/', '1436471342', '1436471342')
    , ('中国建设银行', 'CCB', 'CCB.jpg', 'http://www.ccb.com/', '1436471342', '1436471342')
    , ('中国光大银行', 'CEB', 'CEB.jpg', 'http://www.cebbank.com/', '1436471342', '1436471342')
    , ('兴业银行', 'CIB', 'CIB.jpg', 'http://www.cib.com.cn/', '1436471342', '1436471342')
    , ('中信银行', 'CITIC', 'CITIC.jpg', 'http://bank.ecitic.com/', '1436471342', '1436471342')
    , ('招商银行', 'CMB', 'CMB.jpg', 'http://www.cmbchina.com/', '1436471342', '1436471342')
    , ('中国民生银行', 'CMBC', 'CMBC.jpg', 'http://www.cmbc.com.cn/', '1436471342', '1436471342')
    , ('交通银行', 'COMM', 'COMM.jpg', 'http://www.bankcomm.com/', '1436471342', '1436471342')
    , ('广发银行', 'GDB', 'GDB.jpg', 'http://www.cgbchina.com.cn/', '1436471342', '1436471342')
    , ('华夏银行', 'HXBANK', 'HXBANK.jpg', 'http://www.hxb.com.cn/', '1436471342', '1436471342')
    , ('中国邮政储蓄银行', 'PSBC', 'PSBC.jpg', 'http://www.psbc.com/', '1436471342', '1436471342')
    , ('平安银行', 'SPABANK', 'SPABANK.jpg', 'http://bank.pingan.com/', '1436471342', '1436471342')
    , ('浦发银行', 'SPDB', 'SPDB.jpg', 'http://www.spdb.com.cn/', '1436471342', '1436471342');